# Answering Business Questions using SQL

## Introduction

Here we examine the Chinook.db from the digital record store with tables for artists, albums, media tracks, invoices and customers. There are 11 tables with over 15,000 lines of data.

We will complete a business analysis to see what insights we can uncover utilizing SQL queries

We will use the Chinook database and is provided as a SQLite database file called chinook.db

The data is available here: 
https://github.com/lerocha/chinook-database/tree/master/ChinookDatabase/DataSources

## Setting up SQL Notebook

In [1]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

'Connected: None@chinook.db'

## Data Overview

Let's start by getting familiar with our data.  We shall query the database to get a list of all tables and views in our database

In [2]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table')]

Let us now check a few rows of the tables to familiarise ourselves with the data.

In [3]:
%%sql
SELECT * FROM album LIMIT 5

Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

In [4]:
%%sql
SELECT * FROM artist LIMIT 5

Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains')]

In [5]:
%%sql
SELECT * FROM customer LIMIT 5

Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [6]:
%%sql
SELECT * FROM employee LIMIT 5

Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2016-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2016-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2017-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2017-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2017-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

In [7]:
%%sql
SELECT * FROM genre LIMIT 5

Done.

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll')]

In [8]:
%%sql
SELECT * FROM invoice LIMIT 5

Done.

[(1, 18, '2017-01-03 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 15.84),
 (2, 30, '2017-01-03 00:00:00', '230 Elgin Street', 'Ottawa', 'ON', 'Canada', 'K2P 1L7', 9.9),
 (3, 40, '2017-01-05 00:00:00', '8, Rue Hanovre', 'Paris', 'None', 'France', '75002', 1.98),
 (4, 18, '2017-01-06 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 7.92),
 (5, 27, '2017-01-07 00:00:00', '1033 N Park Ave', 'Tucson', 'AZ', 'USA', '85719', 16.83)]

In [9]:
%%sql
SELECT * FROM invoice_line LIMIT 5

Done.

[(1, 1, 1158, 0.99, 1),
 (2, 1, 1159, 0.99, 1),
 (3, 1, 1160, 0.99, 1),
 (4, 1, 1161, 0.99, 1),
 (5, 1, 1162, 0.99, 1)]

In [10]:
%%sql
SELECT * FROM media_type LIMIT 5

Done.

[(1, 'MPEG audio file'),
 (2, 'Protected AAC audio file'),
 (3, 'Protected MPEG-4 video file'),
 (4, 'Purchased AAC audio file'),
 (5, 'AAC audio file')]

In [11]:
%%sql
SELECT * FROM playlist LIMIT 5

Done.

[(1, 'Music'),
 (2, 'Movies'),
 (3, 'TV Shows'),
 (4, 'Audiobooks'),
 (5, '90’s Music')]

In [12]:
%%sql
SELECT * FROM playlist_track LIMIT 5

Done.

[(1, 3402), (1, 3389), (1, 3390), (1, 3391), (1, 3392)]

In [13]:
%%sql
SELECT * FROM track LIMIT 5

Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, 0.99),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, 0.99),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, 0.99)]

## Selecting Albums to Purchase

### Scenario

The Chinook record store has just signed a deal with a new record label. We have been tasked with selecting the first three albums that will be added to the store, from a list of four. All four albums are by artists that don't have any tracks in the store right now - we have the artist names, and the genre of music they produce.

The record label specializes in artists from the USA, and they have given Chinook some money to advertise the new albums in the USA, so we're interested in finding out which genres sell the best in the USA.

In [14]:
%%sql
WITH USA AS
    (SELECT 
         il.*
         FROM invoice AS i
     INNER JOIN invoice_line AS il ON il.invoice_id = i.invoice_id
     WHERE i.billing_country = 'USA'
     ),
    track_listing AS
    ( SELECT
            t.* ,
            u.invoice_id
     FROM track as t
     INNER JOIN USA AS u ON u.track_id = t.track_id
    )
    
SELECT 
    g.name AS GENRE,
    COUNT(t.invoice_id) AS Total_tracks_sold,
    ROUND((COUNT(t.invoice_id)*100.00)/(SELECT COUNT(*) FROM USA),2) AS Percentage_tracks_Sold
    FROM genre AS g
    INNER JOIN track_listing AS t ON g.genre_id = t.genre_id
    GROUP BY 1
    ORDER BY 2 DESC

Done.

[('Rock', 561, 53.38),
 ('Alternative & Punk', 130, 12.37),
 ('Metal', 124, 11.8),
 ('R&B/Soul', 53, 5.04),
 ('Blues', 36, 3.43),
 ('Alternative', 35, 3.33),
 ('Latin', 22, 2.09),
 ('Pop', 22, 2.09),
 ('Hip Hop/Rap', 20, 1.9),
 ('Jazz', 14, 1.33),
 ('Easy Listening', 13, 1.24),
 ('Reggae', 6, 0.57),
 ('Electronica/Dance', 5, 0.48),
 ('Classical', 4, 0.38),
 ('Heavy Metal', 3, 0.29),
 ('Soundtrack', 2, 0.19),
 ('TV Shows', 1, 0.1)]

Clearly, the genre Rock has the highest percentage of Tracks sold, accounting for more than 50% of all sales. This is followed by Alternative & Punk and Metal.

Going by this trend, we can safely recommend the following artists.
* Red Tone
* Meteor and the Girls
* Slim Jim Bites

Also, considering that Rock makes up more than 50% of all sales, we should be on the lookout for artists and albums from this genre

## Analyzing Employee Sales Performance

Each customer for the Chinook store gets assigned to a sales support agent within the company when they first make a purchase. We have been asked to analyze the purchases of customers belonging to each employee to see if any sales support agent is performing either better or worse than the others.

In [15]:
%%sql
WITH sales AS
    ( SELECT 
        c.*,
        i.total,
        il.quantity
        FROM customer AS c
        LEFT JOIN invoice AS i ON c.customer_id = i.customer_id
        LEFT JOIN invoice_line AS il ON i.invoice_id= il.invoice_id)

SELECT 
    e.employee_id AS Employee_ID,
    e.first_name|| " " || e.last_name AS Employee_Name,
    e.hire_date AS Date_Of_Joining,
    ROUND(SUM(s.total),2) AS Total_Sales_Amount,
    SUM(s.quantity) AS Total_Sales_Quantity
    FROM employee AS e
    LEFT JOIN sales AS s ON e.employee_id = s.support_rep_id
    GROUP BY 1
    HAVING e.title = 'Sales Support Agent'
    ORDER BY 4 DESC

Done.

[(3, 'Jane Peacock', '2017-04-01 00:00:00', 18246.69, 1749),
 (4, 'Margaret Park', '2017-05-03 00:00:00', 15923.16, 1600),
 (5, 'Steve Johnson', '2017-10-17 00:00:00', 13333.32, 1408)]

It seems Jane Peacock is has the highest sales, while Steve Johnson has the lowest. It is worth noting that the Sales figures seem to correlate with the ate of Joining. i.e. Higher sales values correspond to earlier date of joining. This is along expected lines as more time spent in the role shoul lead to more sales

## Analyzing Sales by Country

Your next task is to analyze the sales data for customers from each different country. We have been given guidance to use the country value from the customers table, and ignore the country from the billing address in the invoice table.

In particular, we have been directed to calculate data, for each country, on the:

* total number of customers
* total value of sales
* average value of sales per customer
* average order value

In [16]:
%%sql
WITH country_select AS
(    SELECT
        country,
         CASE 
             WHEN COUNT(DISTINCT(customer_id)) = 1 THEN 'Other'
             ELSE country
             END AS country_type
        FROM customer 
        GROUP BY country)
SELECT 
    Country,
    "Total Number of Customers",
    Total_Sales,
    "Average Sales Per Customer",
    "Average Order Value"
    FROM(
SELECT 
    cs.country_type AS Country, 
    COUNT(DISTINCT(c.customer_id)) AS "Total Number of Customers",
    ROUND(SUM(i.total),2) AS Total_Sales,
    ROUND(SUM(i.total)/COUNT(DISTINCT(c.customer_id)),2) AS "Average Sales Per Customer",
    ROUND(SUM(i.total)/COUNT(DISTINCT(i.invoice_id)),2) AS "Average Order Value",
    CASE
        WHEN cs.country_type = 'Other' THEN 0
        ELSE 1
    END AS sort
    FROM customer AS c
    INNER JOIN invoice AS i ON c.customer_id = i.customer_id
    INNER JOIN country_select AS cs ON c.country = cs.country
    GROUP BY cs.country_type
    ORDER BY sort DESC, 4 DESC
)

Done.

[('Czech Republic', 2, 273.24, 136.62, 9.11),
 ('Portugal', 2, 185.13, 92.57, 6.38),
 ('India', 2, 183.15, 91.57, 8.72),
 ('Brazil', 5, 427.68, 85.54, 7.01),
 ('Germany', 4, 334.62, 83.66, 8.16),
 ('United Kingdom', 3, 245.52, 81.84, 8.77),
 ('USA', 13, 1040.49, 80.04, 7.94),
 ('France', 5, 389.07, 77.81, 7.78),
 ('Canada', 8, 535.59, 66.95, 7.05),
 ('Other', 15, 1094.94, 73.0, 7.45)]

The data shows high values for average sales per customer in Czech Republic, Portugal and India. This might indicate opportunities in these countries.

However, It's worth keeping in mind is that  the amount of data from each of these countries is relatively low. Because of this, we should be cautious spending too much money on new marketing campaigns, as the sample size is not large enough to give us high confidence..
In order to make a better decision, other factors will likely need to be considered (size of country etc). This may make India a more attractive target for new customers in order to maximize marketing dollars.

A good approach would be to run small campaigns in these countries, collecting and analyzing the new customers to make sure that these trends hold with new customers

## Albums vs Individual Tracks

We have been asked to find out what percentage of purchases are individual tracks vs whole albums, so that management can use this data to determine whether it makes sense to continue selling full albums or only selling individual tracks. We will determine the following:

* Number of Invoices
* Percentage of invoices that are full album purchases.

In [17]:
%%sql

WITH invoice_first_track AS
    (
     SELECT
         il.invoice_id invoice_id,
         MIN(il.track_id) first_track_id
     FROM invoice_line il
     GROUP BY 1
    )

SELECT
    album_purchase,
    COUNT(invoice_id) number_of_invoices,
    ROUND(count(invoice_id) * 100.00 / (
                                         SELECT COUNT(*) FROM invoice
                                      ),2) percent
FROM
    (
    SELECT
        ifs.*,
        CASE
            WHEN
                 (
                  SELECT t.track_id FROM track t
                  WHERE t.album_id = (
                                      SELECT t2.album_id FROM track t2
                                      WHERE t2.track_id = ifs.first_track_id
                                     ) 

                  EXCEPT 

                  SELECT il2.track_id FROM invoice_line il2
                  WHERE il2.invoice_id = ifs.invoice_id
                 ) IS NULL
             AND
                 (
                  SELECT il2.track_id FROM invoice_line il2
                  WHERE il2.invoice_id = ifs.invoice_id

                  EXCEPT 

                  SELECT t.track_id FROM track t
                  WHERE t.album_id = (
                                      SELECT t2.album_id FROM track t2
                                      WHERE t2.track_id = ifs.first_track_id
                                     ) 
                 ) IS NULL
             THEN "yes"
             ELSE "no"
         END AS "album_purchase"
     FROM invoice_first_track ifs
    )
GROUP BY album_purchase;

Done.

[('no', 500, 81.43), ('yes', 114, 18.57)]

## Conclusion

We can observe that album purchases account for less than 20% of purchases. Based on this data, it would make sense to purchase only select tracks from albums from record companies rather than buying entire albums